InformationRegisters/ПрайсЛистыКонтрагентовНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовНаценки</Name>
			<Comment>Наценки на прайс-листы контрагентов</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Comment>Размер наценки в процентах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДо</Name>
					<Comment>Округлять расчетную цену до... (знаков после запятой)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АлгоритмыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист, для которого устанавливается наценка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТегПозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовНаценки/Ext/ManagerModule.bsl
// Модуль менеджера регистра "Прайс-листы контрагентов наценки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДополнитьНаценкамиПрайЛиста(ПрайсЛист, ТипЦен, Подразделение, ТегиПроизводители, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТегиИПроизводители.ПрайсЛист КАК ПрайсЛист,
	|	ТегиИПроизводители.ТегПозиции КАК ТегПозиции,
	|	ТегиИПроизводители.Производитель КАК Производитель
	|ПОМЕСТИТЬ ВТ_ТегиИПроизводители
	|ИЗ
	|	&ТегиИПроизводители КАК ТегиИПроизводители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовНаценкиСрезПоследних.ТегПозиции КАК ТегПозиции,
	|	ПрайсЛистыКонтрагентовНаценкиСрезПоследних.Производитель КАК Производитель,
	|	ПрайсЛистыКонтрагентовНаценкиСрезПоследних.Наценка КАК СтарыйПроцент
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовНаценки.СрезПоследних(
	|			&НаДату,
	|			ПрайсЛист = &ПрайсЛист
	|				И ТипЦен = &ТипЦен
	|				И ПодразделениеКомпании = &Подразделение
	|				И (ТегПозиции, Производитель) В
	|					(ВЫБРАТЬ
	|						ВТ_ТегиИПроизводители.ТегПозиции,
	|						ВТ_ТегиИПроизводители.Производитель
	|					ИЗ
	|						ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители)) КАК ПрайсЛистыКонтрагентовНаценкиСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТегПозиции,
	|	Производитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТегиИПроизводители.ПрайсЛист КАК ПрайсЛист,
	|	ВТ_ТегиИПроизводители.ТегПозиции КАК ТегПозиции,
	|	ВТ_ТегиИПроизводители.Производитель КАК Производитель,
	|	ЕСТЬNULL(Цены.СтарыйПроцент, 0) КАК СтарыйПроцент
	|ИЗ
	|	ВТ_ТегиИПроизводители КАК ВТ_ТегиИПроизводители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО ВТ_ТегиИПроизводители.ТегПозиции = Цены.ТегПозиции
	|			И ВТ_ТегиИПроизводители.Производитель = Цены.Производитель";
	
	Запрос.УстановитьПараметр("ТегиИПроизводители" , ТегиПроизводители);
	Запрос.УстановитьПараметр("НаДату"             , НаДату);
	Запрос.УстановитьПараметр("ПрайсЛист"          , ПрайсЛист);
	Запрос.УстановитьПараметр("ТипЦен"             , ТипЦен);
	Запрос.УстановитьПараметр("Подразделение"      , Подразделение);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции 

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	Возврат УникальныеРеквизиты;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли
